app/views/songs/_form.html.erb

SELECT "artists".* FROM "artists"
---
  <%= f.text_field :artist_name %>
  <%= f.select :artist_id, Artist.all.collect { |p| [ p.name, p.id ] }, include_blank: true